# üóÑÔ∏è SQL Basics with SQLite (Day 16 ‚Äì Part 2)

**Goal:**  
Extend SQL knowledge with:  
- JOIN operations (INNER, LEFT)  
- Combining data from multiple tables  
- More practice with filtering

 # 1. Import SQLite & Setup (same as Day 15)

In [1]:
import sqlite3
import pandas as pd

# Create new in-memory database
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# 2. Create Tables

In [2]:
cursor.execute("""
CREATE TABLE students (
    student_id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    major TEXT
)
""")

cursor.execute("""
CREATE TABLE courses (
    course_id INTEGER PRIMARY KEY,
    course_name TEXT,
    credits INTEGER
)
""")

cursor.execute("""
CREATE TABLE enrollments (
    enrollment_id INTEGER PRIMARY KEY,
    student_id INTEGER,
    course_id INTEGER,
    grade TEXT,
    FOREIGN KEY(student_id) REFERENCES students(student_id),
    FOREIGN KEY(course_id) REFERENCES courses(course_id)
)
""")

# 3. Insert Sample Data

In [3]:
students_data = [
    (1, "Ali", 21, "Computer Science"),
    (2, "Sara", 22, "Information Tech"),
    (3, "Farhan", 20, "Mathematics"),
    (4, "Meera", 23, "Statistics")
]

courses_data = [
    (101, "Database Systems", 3),
    (102, "Machine Learning", 4),
    (103, "Probability & Stats", 3)
]

enrollments_data = [
    (1, 1, 101, "A"),
    (2, 1, 102, "B"),
    (3, 2, 101, "A"),
    (4, 3, 103, "B"),
    (5, 4, 102, "A")
]

cursor.executemany("INSERT INTO students VALUES (?, ?, ?, ?)", students_data)
cursor.executemany("INSERT INTO courses VALUES (?, ?, ?)", courses_data)
cursor.executemany("INSERT INTO enrollments VALUES (?, ?, ?, ?)", enrollments_data)
conn.commit()

# 4. INNER JOIN Example

In [5]:
query = """
SELECT s.name, c.course_name, e.grade
FROM enrollments e
JOIN students s ON e.student_id = s.student_id
JOIN courses c ON e.course_id = c.course_id
"""
pd.read_sql(query, conn)

     name          course_name grade
0     Ali     Database Systems     A
1     Ali     Machine Learning     B
2    Sara     Database Systems     A
3  Farhan  Probability & Stats     B
4   Meera     Machine Learning     A

# 5. LEFT JOIN Example

In [6]:
query = """
SELECT s.name, c.course_name, e.grade
FROM students s
LEFT JOIN enrollments e ON s.student_id = e.student_id
LEFT JOIN courses c ON e.course_id = c.course_id
"""
pd.read_sql(query, conn)

     name          course_name grade
0     Ali     Database Systems     A
1     Ali     Machine Learning     B
2    Sara     Database Systems     A
3  Farhan  Probability & Stats     B
4   Meera     Machine Learning     A

# 6. Filtering with JOIN

In [7]:
query = """
SELECT s.name, c.course_name, e.grade
FROM enrollments e
JOIN students s ON e.student_id = s.student_id
JOIN courses c ON e.course_id = c.course_id
WHERE e.grade = 'A'
"""
pd.read_sql(query, conn)

    name       course_name grade
0    Ali  Database Systems     A
1   Sara  Database Systems     A
2  Meera  Machine Learning     A

# ‚úÖ Summary (Day 16 ‚Äì Part 2):

- Created enrollments table to connect students & courses
- Practiced INNER JOIN and LEFT JOIN
- Combined data across multiple tables
- Filtered joined results (WHERE grade = 'A')